## Plan Result (Aks_ithc - DeployInfrastructure)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 3 to change, 1 to destroy.</code></pre>

* Update
  * module.kubernetes[&#34;00&#34;].azurerm_kubernetes_cluster.kubernetes_cluster
  * module.kubernetes[&#34;00&#34;].azurerm_kubernetes_cluster_node_pool.additional_node_pools[&#34;cronjob&#34;]
  * module.kubernetes[&#34;00&#34;].azurerm_kubernetes_cluster_node_pool.additional_node_pools[&#34;spotinstance&#34;]
* Replace
  * module.kubernetes[&#34;00&#34;].azurerm_kubernetes_cluster_node_pool.additional_node_pools[&#34;linux&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.kubernetes["00"].azurerm_kubernetes_cluster.kubernetes_cluster will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "kubernetes_cluster" {
      ~ azure_policy_enabled                = true -> false
        id                                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-00-rg/providers/Microsoft.ContainerService/managedClusters/cft-ithc-00-aks"
      ~ kubernetes_version                  = "1.30.5" -> "1.30"
        name                                = "cft-ithc-00-aks"
        tags                                = {
            "application"  = "core"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/aks-cft-deploy"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "ithc"
        }
        # (35 unchanged attributes hidden)

      ~ default_node_pool {
            name                          = "system"
          ~ orchestrator_version          = "1.30.5" -> "1.30"
            tags                          = {
                "application"  = "core"
                "autoShutdown" = "true"
                "builtFrom"    = "hmcts/aks-cft-deploy"
                "businessArea" = "CFT"
                "criticality"  = "Medium"
                "environment"  = "ithc"
            }
            # (30 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (9 unchanged blocks hidden)
    }

  # module.kubernetes["00"].azurerm_kubernetes_cluster_node_pool.additional_node_pools["cronjob"] will be updated in-place
  ~ resource "azurerm_kubernetes_cluster_node_pool" "additional_node_pools" {
        id                            = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-00-rg/providers/Microsoft.ContainerService/managedClusters/cft-ithc-00-aks/agentPools/cronjob"
        name                          = "cronjob"
      ~ orchestrator_version          = "1.30.5" -> "1.30"
        tags                          = {
            "application"  = "core"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/aks-cft-deploy"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "ithc"
        }
        # (32 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.kubernetes["00"].azurerm_kubernetes_cluster_node_pool.additional_node_pools["linux"] must be replaced
-/+ resource "azurerm_kubernetes_cluster_node_pool" "additional_node_pools" {
      - custom_ca_trust_enabled       = false -> null
      - enable_host_encryption        = false -> null
      - enable_node_public_ip         = false -> null
      - fips_enabled                  = false -> null
      ~ id                            = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-00-rg/providers/Microsoft.ContainerService/managedClusters/cft-ithc-00-aks/agentPools/linux" -> (known after apply)
      ~ kubelet_disk_type             = "OS" -> (known after apply)
      ~ max_count                     = 40 -> 4
      ~ min_count                     = 15 -> 2
        name                          = "linux"
      ~ node_count                    = 24 -> (known after apply)
      ~ node_labels                   = {} -> (known after apply)
      ~ orchestrator_version          = "1.30.5" -> "1.30"
      ~ os_disk_size_gb               = 128 -> (known after apply)
      ~ os_sku                        = "Ubuntu" -> (known after apply)
        tags                          = {
            "application"  = "core"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/aks-cft-deploy"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "ithc"
        }
      ~ vm_size                       = "Standard_D8ds_v5" -> "Standard_DS3_v2" # forces replacement
        # (20 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.kubernetes["00"].azurerm_kubernetes_cluster_node_pool.additional_node_pools["spotinstance"] will be updated in-place
  ~ resource "azurerm_kubernetes_cluster_node_pool" "additional_node_pools" {
        id                            = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-00-rg/providers/Microsoft.ContainerService/managedClusters/cft-ithc-00-aks/agentPools/spotinstance"
        name                          = "spotinstance"
      ~ orchestrator_version          = "1.30.5" -> "1.30"
        tags                          = {
            "application"  = "core"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/aks-cft-deploy"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "ithc"
        }
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 3 to change, 1 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":678,"Program":"tfcmt","SHA1":"","Target":"Aks_ithc - DeployInfrastructure","Vars":{}} -->